# Function Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WallType..::..Function Property
WallType Class See Also
---
The wall function.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public WallFunction Function { get; set; }
```

Visual Basic
---
```text
Public Property Function As WallFunction
	Get
	Set
```

Visual C++
---
```text
public:
property WallFunction Function {
	WallFunction get ();
	void set (WallFunction value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
WallType Class
Autodesk.Revit.DB Namespace